---
kind: type
id: T:Autodesk.Revit.DB.Architecture.PatternJustification
source: html/84331a13-d499-65fa-8d6c-75a83ee3cb42.htm
---
# Autodesk.Revit.DB.Architecture.PatternJustification

Justification of patterns distribution.

## Syntax (C#)
```csharp
public enum PatternJustification
```